In [57]:
import pandas as pd
import requests
#from pyodide.http import pyfetch


url = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%205/data/addresses.csv"
response = requests.get(url)
filename = "addresses.csv"

with open(filename, "wb") as f:
    f.write(response.content)

df = pd.read_csv(filename, header=None)

In [9]:
df

,0,1,2,3,4,5
0,John,Doe,120 jefferson st.,Riverside,NJ,8075
1,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
2,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
3,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
4,NaN,Blankman,NaN,SomeTown,SD,298
5,"Joan ""the bone"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123

In [59]:
df.columns = ['First Name', 'Last Name', 'Location', 'City', 'State', 'Area Code' ]

In [56]:
df

,First Name,Last Name,Location,City,State,Area Code
0,John,Doe,120 jefferson st.,Riverside,NJ,8075
1,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
2,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
3,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
4,NaN,Blankman,NaN,SomeTown,SD,298
5,"Joan ""the bone"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123

In [61]:
df[["First Name", "City"]]

              First Name         City
0                   John    Riverside
1                   Jack        Phila
2          John "Da Man"    Riverside
3                Stephen     SomeTown
4                    NaN     SomeTown
5  Joan "the bone", Anne  Desert City

In [14]:
df.loc[2]

First Name        John "Da Man"
Last Name                Repici
Location      120 Jefferson St.
City                  Riverside
State                        NJ
Area Code                  8075
Name: 2, dtype: object

In [16]:
df.iloc[[0,1,2], 0]

0             John
1             Jack
2    John "Da Man"
Name: First Name, dtype: object

In [17]:
import numpy as np

In [23]:
df=pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), columns=['a', 'b', 'c'])
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [24]:
df = df.transform(func = lambda x: x +10)
df

    a   b   c
0  11  12  13
1  14  15  16
2  17  18  19

In [25]:
result = df.transform(func = ['sqrt'])
result

          a         b         c
       sqrt      sqrt      sqrt
0  3.316625  3.464102  3.605551
1  3.741657  3.872983  4.000000
2  4.123106  4.242641  4.358899

In [26]:
import json

In [27]:
person = {
    'first_name' : 'Mark',
    'last_name' : 'abc',
    'age' : 27,
    'address': {
        "streetAddress": "21 2nd Street",
        "city": "New York",
        "state": "NY",
        "postalCode": "10021-3100"
    }
}

In [28]:
with open('person.json', 'w') as f:
    json.dump(person, f)

In [29]:

with open("person.json", 'r') as f:
    x = json.load(f)
    x

In [32]:
from PIL import Image

In [40]:
url = "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/dog-puppy-on-garden-royalty-free-image-1586966191.jpg"
response = requests.get(url)
filename = "./dog.jpg"
with open(filename, "wb") as f:
    for chunk in response.iter_content(chunk_size=8192):
        f.write(chunk)
    

img = Image.open('./dog.jpg', 'r')

In [41]:
img.show()

In [43]:
name = "ABCDE"
name.find("B")

1

In [44]:
2//4

0

In [45]:
 '1,2,3,4'.split(',')

['1', '2', '3', '4']

In [52]:
a=[1,2,36,4,7,2]
a.sort()

In [53]:
a

[1, 2, 2, 4, 7, 36]

In [62]:
for n in range(0,2):
    print("ola")

ola
ola